public class Main {

}
/*
1. 드라마 이상한 변호사 우영우에서 주인공 우영우가 자기 소개를 할때 제 이름은 똑바로 읽어도
거꾸로 읽어도 우영우 입니다. 기러기 토마토 스위스 인도인 별동별 처럼 이를 회문 또는 팰린드롬
이라고 합니다 단어를 입력받고 회문이면 yes 아니면 no인 프로그램을 만드시오

2. 알파벳 대문자 또는 소문자로 이루어진 문자열을 입력받아 같은 문자가 연속적으로 면번 반복
되는지 오른쪽에 반복횟수를 표기하는 방법으로 문자열을 압축하는 프로그램을 작성하세요
입력문자 : innnnovaaattiioonnnnn
출력 : in4ova3ti2o2n5

3. 로미오는 원수의 딸인 줄리엣에게 알파벳 대문자로 구성된 비밀편지를 email로 매일 보낸다
비밀편지는 로미오와 줄리엣만 알고잇는 암호로 만들어 졌습니다 비밀편지는 알파벳 한 문자마다
#또는 *가 일곱개씩 구성되어 있습니다 만약 로미오가 #*****#으로 구성된 문자를 보냈다면
줄리엣은 로미오와 약속한 규칙대로 다음과 같이 해석 할 수 있습니다
- #*****# >> 1000001 일곱자리의 이진수로 바꿉니다. #은 이진수 1로, *은 이진수 0으로 변환
- 아스키 번호가 65문자로 변환되면 65는 대분자 A입니다 ex) A : 65 , B : 66 ~ Z : 90
로미호가 4개의 문자를 아래와 같이 신호를 보냈다면
##*##**
##*####
###*##*
##**#*#
출력되는 문자는 무엇인가요

4. 선생님 N명의 학생을 일렬로 줄세우고, 일렬로 서 있는 학생의 키가 앞에서부터 순서대로
주어질때, 맨 앞에서 선생님이 볼 수 있는 학생의 수를 구하는 프로그램을 작성하세요
ex) 어떤 학생이 자기 앞에 서있는 학생들보다 크면 그 학생은 보이고, 작으면 안보임
입력 : 7
145 160 153 161 158 170 180
출력결과 : 5
*/